In [1]:
import pandas as pd

In [2]:
# !pip install <modulename> install using pip if its not available

#### Series

In [3]:
# 1D data structure 
# it can be cretaed using list/tuple/1d array
# cant hold multiple data types together 
# Series(values, index, dtype)

In [4]:
import pandas as pd
sr1 = pd.Series([10,20,30,40,50])
sr1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
# numbers : int/float 
# Strings: object

In [6]:
print(sr1[3])

40

In [7]:
# Attribute Error:
# 1. Case sensitive 
# 2. Spelling mistake 
# 3. Function doesnt exist in library

In [8]:
sr2 = pd.Series([10,20,30,40,50], index = ['a','b','c','d','e'], dtype = float)
sr2

a    10.0
b    20.0
c    30.0
d    40.0
e    50.0
dtype: float64

In [9]:
sr2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [10]:
sr2.values

array([10., 20., 30., 40., 50.])

In [11]:
sr2.dtype

dtype('float64')

In [12]:
sr2['d']

40.0

In [13]:
# a --> it will add cell above 
# b --> add cell below

#### Data Frame

In [14]:
# 2D data structure 
# to create data frame / sql table --> we need to pass data in column format
# each column should have single data type
# a column can be created using series, list, tuple , 1D array

In [15]:
dict1 = {
    'col1': [10,20,30,40,50],
    'col2': pd.Series(['a','b','c','d','e'])
}

In [16]:
df1 = pd.DataFrame(dict1)
df1

   col1 col2
0    10    a
1    20    b
2    30    c
3    40    d
4    50    e

In [17]:
output = df1.dtypes # series
output

col1     int64
col2    object
dtype: object

In [18]:
output.index

Index(['col1', 'col2'], dtype='object')

In [19]:
output.values

array([dtype('int64'), dtype('O')], dtype=object)

In [20]:
output.dtype

dtype('O')

In [21]:
dict1={'coll1' :[10,20,30,40], 
      'coll2' :pd.Series(['a','b','c','d','e','f','g'])
     }
dict1

{'coll1': [10, 20, 30, 40],
 'coll2': 0    a
 1    b
 2    c
 3    d
 4    e
 5    f
 6    g
 dtype: object}

In [22]:
pd.Series(['a','b','c','d','e','f','g'])

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object

####

#### Merge

In [23]:
# SQL JOIN = Pandas Merge

In [24]:
# data is getting generated from two excel files 
# if i wanted to join --> create tables in sql --> insert data --> perform join condition --> extract the output

In [25]:
# pandas --> load two excel files directly --> use merge and perform operation

In [26]:
df1 = pd.DataFrame({'id': [1,2,3,4,5], 'stat_marks': [99,97,93,92,98]})
df2 = pd.DataFrame({'id': [3,4,5,6,7], 'ml_marks': [92,94,98,95,89]})
df2

   id  ml_marks
0   3        92
1   4        94
2   5        98
3   6        95
4   7        89

In [27]:
# pandas merge = SQL Join
# objective : to extract data for who appeared in both exams
# select * from df1 join df2 on df1.id = df2.id

df1.merge(df2, on = 'id', how = 'inner')

   id  stat_marks  ml_marks
0   3          93        92
1   4          92        94
2   5          98        98

In [28]:
df1.merge(df2, on = 'id', how = 'left') # df1 --> left table , df2 --> right table
# NaN --> SQL Null/ empty/ blank/ no value in that place

   id  stat_marks  ml_marks
0   1          99       NaN
1   2          97       NaN
2   3          93      92.0
3   4          92      94.0
4   5          98      98.0

In [29]:
df1.merge(df2, on = 'id', how = 'right')

   id  stat_marks  ml_marks
0   3        93.0        92
1   4        92.0        94
2   5        98.0        98
3   6         NaN        95
4   7         NaN        89

In [30]:
df1.merge(df2, on = 'id', how = 'outer')

   id  stat_marks  ml_marks
0   1        99.0       NaN
1   2        97.0       NaN
2   3        93.0      92.0
3   4        92.0      94.0
4   5        98.0      98.0
5   6         NaN      95.0
6   7         NaN      89.0

In [31]:
# Hypothetical Situations # modify data frames accordingly to work
# if the name is different in both data frame ( tables )
# df1.merge(df2, left_on = 'id', right_on = 'sno', how = 'inner') # use left_on , right_on if names are different

# to join on multiple columns
# df1.merge(df2, on = ['id','school'], how = 'inner')
# df1.merge(df2, left_on = ['id','school'], right_on = ['sno','inst'] how = 'inner') # use left_on , right_on if names are different

#### Concat

In [32]:
# SQL Union == Pandas Concat

In [33]:
df1 = pd.DataFrame({'id': [1,2,3,4,5], 'stat_marks': [99,97,93,92,98]})
df2 = pd.DataFrame({'id': [3,4,5,6,7], 'stat_marks': [92,94,98,95,89]})
# we are stack / join / append one data frame on another
# Ensure column names are same in two data frames
# if objective is to combine monthly data to master data table

pd.concat([df1,df2])

   id  stat_marks
0   1          99
1   2          97
2   3          93
3   4          92
4   5          98
0   3          92
1   4          94
2   5          98
3   6          95
4   7          89

In [34]:
df1 = pd.DataFrame({'id': [1,2,3,4,5], 'stat_marks': [99,97,93,92,98]})
df2 = pd.DataFrame({'id': [3,4,5,6,7], 'ml_marks': [92,94,98,95,89]})

pd.concat([df1,df2])

   id  stat_marks  ml_marks
0   1        99.0       NaN
1   2        97.0       NaN
2   3        93.0       NaN
3   4        92.0       NaN
4   5        98.0       NaN
0   3         NaN      92.0
1   4         NaN      94.0
2   5         NaN      98.0
3   6         NaN      95.0
4   7         NaN      89.0

In [35]:
# my original data is not getting modified
df1

   id  stat_marks
0   1          99
1   2          97
2   3          93
3   4          92
4   5          98

In [36]:
df2

   id  ml_marks
0   3        92
1   4        94
2   5        98
3   6        95
4   7        89

In [38]:
df3 = pd.concat([df1,df2])
df3

   id  stat_marks  ml_marks
0   1        99.0       NaN
1   2        97.0       NaN
2   3        93.0       NaN
3   4        92.0       NaN
4   5        98.0       NaN
0   3         NaN      92.0
1   4         NaN      94.0
2   5         NaN      98.0
3   6         NaN      95.0
4   7         NaN      89.0

In [39]:
df3.reset_index() # reset index as a funciton is going to store older index as a column by default
# drop = False # by default

   index  id  stat_marks  ml_marks
0      0   1        99.0       NaN
1      1   2        97.0       NaN
2      2   3        93.0       NaN
3      3   4        92.0       NaN
4      4   5        98.0       NaN
5      0   3         NaN      92.0
6      1   4         NaN      94.0
7      2   5         NaN      98.0
8      3   6         NaN      95.0
9      4   7         NaN      89.0

In [40]:
df3.reset_index(drop = True) # drop = True --> will not save older index

   id  stat_marks  ml_marks
0   1        99.0       NaN
1   2        97.0       NaN
2   3        93.0       NaN
3   4        92.0       NaN
4   5        98.0       NaN
5   3         NaN      92.0
6   4         NaN      94.0
7   5         NaN      98.0
8   6         NaN      95.0
9   7         NaN      89.0

In [41]:
# df3 = df3.reset_index(drop = True) execute the operation and store the result in df3
df3.reset_index(drop = True, inplace = True) # execute the operation and store the result in df3
# once change is made permanent you cant roll back
# df4 = df3.reset_index(drop = True) # store in a new variable --> to avoid issues

df3

   id  stat_marks  ml_marks
0   1        99.0       NaN
1   2        97.0       NaN
2   3        93.0       NaN
3   4        92.0       NaN
4   5        98.0       NaN
5   3         NaN      92.0
6   4         NaN      94.0
7   5         NaN      98.0
8   6         NaN      95.0
9   7         NaN      89.0